GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k40.h
extern volatile TMR3Lbits_t TMR3Lbits __at(0xFC7);
// bitfield macros
#define _TMR3L_TMR3L0_POSN                                  0x0
#define _TMR3L_TMR3L0_POSITION                              0x0
#define _TMR3L_TMR3L0_SIZE                                  0x1
#define _TMR3L_TMR3L0_LENGTH                                0x1
#define _TMR3L_TMR3L0_MASK                                  0x1
#define _TMR3L_TMR3L1_POSN                                  0x1
#define _TMR3L_TMR3L1_POSITION                              0x1
#define _TMR3L_TMR3L1_SIZE                                  0x1
#define _TMR3L_TMR3L1_LENGTH                                0x1
#define _TMR3L_TMR3L1_MASK                                  0x2
#define _TMR3L_TMR3L2_POSN                                  0x2
#define _TMR3L_TMR3L2_POSITION                              0x2
#define _TMR3L_TMR3L2_SIZE                                  0x1
#define _TMR3L_TMR3L2_LENGTH                                0x1
#define _TMR3L_TMR3L2_MASK                                  0x4
#define _TMR3L_TMR3L3_POSN                                  0x3
#define _TMR3L_TMR3L3_POSITION                              0x3
#define _TMR3L_TMR3L3_SIZE                                  0x1
#define _TMR3L_TMR3L3_LENGTH                                0x1
#define _TMR3L_TMR3L3_MASK                                  0x8
#define _TMR3L_TMR3L4_POSN                                  0x4
#define _TMR3L_TMR3L4_POSITION                              0x4
#define _TMR3L_TMR3L4_SIZE                                  0x1
#define _TMR3L_TMR3L4_LENGTH                                0x1
#define _TMR3L_TMR3L4_MASK                                  0x10
#define _TMR3L_TMR3L5_POSN                                  0x5
#define _TMR3L_TMR3L5_POSITION                              0x5
#define _TMR3L_TMR3L5_SIZE                                  0x1
#define _TMR3L_TMR3L5_LENGTH                                0x1
#define _TMR3L_TMR3L5_MASK                                  0x20
#define _TMR3L_TMR3L6_POSN                                  0x6
#define _TMR3L_TMR3L6_POSITION                              0x6
#define _TMR3L_TMR3L6_SIZE                                  0x1
#define _TMR3L_TMR3L6_LENGTH                                0x1
#define _TMR3L_TMR3L6_MASK                                  0x40
#define _TMR3L_TMR3L7_POSN                                  0x7
#define _TMR3L_TMR3L7_POSITION                              0x7
#define _TMR3L_TMR3L7_SIZE                                  0x1
#define _TMR3L_TMR3L7_LENGTH                                0x1
#define _TMR3L_TMR3L7_MASK                                  0x80
#define _TMR3L_TMR3L_POSN                                   0x0
#define _TMR3L_TMR3L_POSITION                               0x0
#define _TMR3L_TMR3L_SIZE                                   0x8
#define _TMR3L_TMR3L_LENGTH                                 0x8
#define _TMR3L_TMR3L_MASK                                   0xFF
#define _TMR3L_TMR30_POSN                                   0x0
#define _TMR3L_TMR30_POSITION                               0x0
#define _TMR3L_TMR30_SIZE                                   0x1
#define _TMR3L_TMR30_LENGTH                                 0x1
#define _TMR3L_TMR30_MASK                                   0x1
#define _TMR3L_TMR31_POSN                                   0x1
#define _TMR3L_TMR31_POSITION                               0x1
#define _TMR3L_TMR31_SIZE                                   0x1
#define _TMR3L_TMR31_LENGTH                                 0x1
#define _TMR3L_TMR31_MASK                                   0x2
#define _TMR3L_TMR32_POSN                                   0x2
#define _TMR3L_TMR32_POSITION                               0x2
#define _TMR3L_TMR32_SIZE                                   0x1
#define _TMR3L_TMR32_LENGTH                                 0x1
#define _TMR3L_TMR32_MASK                                   0x4
#define _TMR3L_TMR33_POSN                                   0x3
#define _TMR3L_TMR33_POSITION                               0x3
#define _TMR3L_TMR33_SIZE                                   0x1
#define _TMR3L_TMR33_LENGTH                                 0x1
#define _TMR3L_TMR33_MASK                                   0x8
#define _TMR3L_TMR34_POSN                                   0x4
#define _TMR3L_TMR34_POSITION                               0x4
#define _TMR3L_TMR34_SIZE                                   0x1
#define _TMR3L_TMR34_LENGTH                                 0x1
#define _TMR3L_TMR34_MASK                                   0x10
#define _TMR3L_TMR35_POSN                                   0x5
#define _TMR3L_TMR35_POSITION                               0x5
#define _TMR3L_TMR35_SIZE                                   0x1
#define _TMR3L_TMR35_LENGTH                                 0x1
#define _TMR3L_TMR35_MASK                                   0x20
#define _TMR3L_TMR36_POSN                                   0x6
#define _TMR3L_TMR36_POSITION                               0x6
#define _TMR3L_TMR36_SIZE                                   0x1
#define _TMR3L_TMR36_LENGTH                                 0x1
#define _TMR3L_TMR36_MASK                                   0x40
#define _TMR3L_TMR37_POSN                                   0x7
#define _TMR3L_TMR37_POSITION                               0x7
#define _TMR3L_TMR37_SIZE                                   0x1
#define _TMR3L_TMR37_LENGTH                                 0x1
#define _TMR3L_TMR37_MASK                                   0x80
#define _TMR3L_CAL03_POSN                                   0x0
#define _TMR3L_CAL03_POSITION                               0x0
#define _TMR3L_CAL03_SIZE                                   0x1
#define _TMR3L_CAL03_LENGTH                                 0x1
#define _TMR3L_CAL03_MASK                                   0x1
#define _TMR3L_CAL13_POSN                                   0x1
#define _TMR3L_CAL13_POSITION                               0x1
#define _TMR3L_CAL13_SIZE                                   0x1
#define _TMR3L_CAL13_LENGTH                                 0x1
#define _TMR3L_CAL13_MASK                                   0x2
#define _TMR3L_CAL23_POSN                                   0x2
#define _TMR3L_CAL23_POSITION                               0x2
#define _TMR3L_CAL23_SIZE                                   0x1
#define _TMR3L_CAL23_LENGTH                                 0x1
#define _TMR3L_CAL23_MASK                                   0x4
#define _TMR3L_CAL33_POSN                                   0x3
#define _TMR3L_CAL33_POSITION                               0x3
#define _TMR3L_CAL33_SIZE                                   0x1
#define _TMR3L_CAL33_LENGTH                                 0x1
#define _TMR3L_CAL33_MASK                                   0x8
#define _TMR3L_CAL43_POSN                                   0x4
#define _TMR3L_CAL43_POSITION                               0x4
#define _TMR3L_CAL43_SIZE                                   0x1
#define _TMR3L_CAL43_LENGTH                                 0x1
#define _TMR3L_CAL43_MASK                                   0x10
#define _TMR3L_CAL53_POSN                                   0x5
#define _TMR3L_CAL53_POSITION                               0x5
#define _TMR3L_CAL53_SIZE                                   0x1
#define _TMR3L_CAL53_LENGTH                                 0x1
#define _TMR3L_CAL53_MASK                                   0x20
#define _TMR3L_CAL63_POSN                                   0x6
#define _TMR3L_CAL63_POSITION                               0x6
#define _TMR3L_CAL63_SIZE                                   0x1
#define _TMR3L_CAL63_LENGTH                                 0x1
#define _TMR3L_CAL63_MASK                                   0x40
#define _TMR3L_CAL73_POSN                                   0x7
#define _TMR3L_CAL73_POSITION                               0x7
#define _TMR3L_CAL73_SIZE                                   0x1
#define _TMR3L_CAL73_LENGTH                                 0x1
#define _TMR3L_CAL73_MASK                                   0x80

