GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k40.h
#define                                 LATA3_bit           _BIT_ACCESS(LATA,3)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
extern volatile __bit                   LATA7               __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 LATA7_bit           _BIT_ACCESS(LATA,7)
// LATB<LATB0>
extern volatile __bit                   LATB0               __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 LATB0_bit           _BIT_ACCESS(LATB,0)
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
extern volatile __bit                   LATB6               __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 LATB6_bit           _BIT_ACCESS(LATB,6)
// LATB<LATB7>
extern volatile __bit                   LATB7               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 LATB7_bit           _BIT_ACCESS(LATB,7)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x7C28);	// @ (0xF85 * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// LATB<LB0>
extern volatile __bit                   LB0                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 LB0_bit             _BIT_ACCESS(LATB,0)
// LATB<LB1>
extern volatile __bit                   LB1                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 LB1_bit             _BIT_ACCESS(LATB,1)
// LATB<LB2>
extern volatile __bit                   LB2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 LB2_bit             _BIT_ACCESS(LATB,2)
// LATB<LB3>
extern volatile __bit                   LB3                 __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 LB3_bit             _BIT_ACCESS(LATB,3)
// LATB<LB4>
extern volatile __bit                   LB4                 __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 LB4_bit             _BIT_ACCESS(LATB,4)
// LATB<LB5>
extern volatile __bit                   LB5                 __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 LB5_bit             _BIT_ACCESS(LATB,5)
// LATB<LB6>
extern volatile __bit                   LB6                 __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 LB6_bit             _BIT_ACCESS(LATB,6)
// LATB<LB7>
extern volatile __bit                   LB7                 __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 LB7_bit             _BIT_ACCESS(LATB,7)
// LATC<LC0>
extern volatile __bit                   LC0                 __at(0x7C28);	// @ (0xF85 * 8 + 0)
#define                                 LC0_bit             _BIT_ACCESS(LATC,0)
// LATC<LC1>
extern volatile __bit                   LC1                 __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 LC1_bit             _BIT_ACCESS(LATC,1)
// LATC<LC2>
extern volatile __bit                   LC2                 __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 LC2_bit             _BIT_ACCESS(LATC,2)
// LATC<LC3>
extern volatile __bit                   LC3                 __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 LC3_bit             _BIT_ACCESS(LATC,3)
// LATC<LC4>
extern volatile __bit                   LC4                 __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 LC4_bit             _BIT_ACCESS(LATC,4)
// LATC<LC5>
extern volatile __bit                   LC5                 __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 LC5_bit             _BIT_ACCESS(LATC,5)
// LATC<LC6>
extern volatile __bit                   LC6                 __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 LC6_bit             _BIT_ACCESS(LATC,6)
// LATC<LC7>
extern volatile __bit                   LC7                 __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 LC7_bit             _BIT_ACCESS(LATC,7)
// CWG1CON0<LD>
extern volatile __bit                   LD                  __at(0x7A26);	// @ (0xF44 * 8 + 6)
#define                                 LD_bit              _BIT_ACCESS(CWG1CON0,6)
// OSCEN<LFOEN>
extern volatile __bit                   LFOEN               __at(0x76E4);	// @ (0xEDC * 8 + 4)
#define                                 LFOEN_bit           _BIT_ACCESS(OSCEN,4)
// OSCSTAT<LFOR>
extern volatile __bit                   LFOR                __at(0x76DC);	// @ (0xEDB * 8 + 4)
#define                                 LFOR_bit            _BIT_ACCESS(OSCSTAT,4)
// CWG1AS0<LSAC0>
extern volatile __bit                   LSAC0               __at(0x7A32);	// @ (0xF46 * 8 + 2)
#define                                 LSAC0_bit           _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<LSAC1>
extern volatile __bit                   LSAC1               __at(0x7A33);	// @ (0xF46 * 8 + 3)
#define                                 LSAC1_bit           _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<LSBD0>
extern volatile __bit                   LSBD0               __at(0x7A34);	// @ (0xF46 * 8 + 4)
#define                                 LSBD0_bit           _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<LSBD1>
extern volatile __bit                   LSBD1               __at(0x7A35);	// @ (0xF46 * 8 + 5)
#define                                 LSBD1_bit           _BIT_ACCESS(CWG1AS0,5)
// PORTA<LVDIN>
extern volatile __bit                   LVDIN               __at(0x7C6D);	// @ (0xF8D * 8 + 5)
#define                                 LVDIN_bit           _BIT_ACCESS(PORTA,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x79E8);	// @ (0xF3D * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x79E9);	// @ (0xF3D * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// MDCON0<MDBIT>
extern volatile __bit                   MDBIT               __at(0x7A88);	// @ (0xF51 * 8 + 0)
#define                                 MDBIT_bit           _BIT_ACCESS(MDCON0,0)
// MDCARHPPS<MDCARHPPS0>
extern volatile __bit                   MDCARHPPS0          __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 MDCARHPPS0_bit      _BIT_ACCESS(MDCARHPPS,0)
// MDCARHPPS<MDCARHPPS1>
extern volatile __bit                   MDCARHPPS1          __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 MDCARHPPS1_bit      _BIT_ACCESS(MDCARHPPS,1)
// MDCARHPPS<MDCARHPPS2>
extern volatile __bit                   MDCARHPPS2          __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 MDCARHPPS2_bit      _BIT_ACCESS(MDCARHPPS,2)
// MDCARHPPS<MDCARHPPS3>
extern volatile __bit                   MDCARHPPS3          __at(0x759B);	// @ (0xEB3 * 8 + 3)
#define                                 MDCARHPPS3_bit      _BIT_ACCESS(MDCARHPPS,3)
// MDCARHPPS<MDCARHPPS4>
extern volatile __bit                   MDCARHPPS4          __at(0x759C);	// @ (0xEB3 * 8 + 4)
#define                                 MDCARHPPS4_bit      _BIT_ACCESS(MDCARHPPS,4)
// MDCARLPPS<MDCARLPPS0>
extern volatile __bit                   MDCARLPPS0          __at(0x7590);	// @ (0xEB2 * 8 + 0)
#define                                 MDCARLPPS0_bit      _BIT_ACCESS(MDCARLPPS,0)
// MDCARLPPS<MDCARLPPS1>
extern volatile __bit                   MDCARLPPS1          __at(0x7591);	// @ (0xEB2 * 8 + 1)
#define                                 MDCARLPPS1_bit      _BIT_ACCESS(MDCARLPPS,1)
// MDCARLPPS<MDCARLPPS2>
extern volatile __bit                   MDCARLPPS2          __at(0x7592);	// @ (0xEB2 * 8 + 2)
#define                                 MDCARLPPS2_bit      _BIT_ACCESS(MDCARLPPS,2)
// MDCARLPPS<MDCARLPPS3>
extern volatile __bit                   MDCARLPPS3          __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 MDCARLPPS3_bit      _BIT_ACCESS(MDCARLPPS,3)
// MDCARLPPS<MDCARLPPS4>
extern volatile __bit                   MDCARLPPS4          __at(0x7594);	// @ (0xEB2 * 8 + 4)
#define                                 MDCARLPPS4_bit      _BIT_ACCESS(MDCARLPPS,4)
// MDCON1<MDCHPOL>
extern volatile __bit                   MDCHPOL             __at(0x7A95);	// @ (0xF52 * 8 + 5)
#define                                 MDCHPOL_bit         _BIT_ACCESS(MDCON1,5)
// MDCARH<MDCHS0>
extern volatile __bit                   MDCHS0              __at(0x7AA8);	// @ (0xF55 * 8 + 0)
#define                                 MDCHS0_bit          _BIT_ACCESS(MDCARH,0)
// MDCARH<MDCHS1>
extern volatile __bit                   MDCHS1              __at(0x7AA9);	// @ (0xF55 * 8 + 1)
#define                                 MDCHS1_bit          _BIT_ACCESS(MDCARH,1)
// MDCARH<MDCHS2>
extern volatile __bit                   MDCHS2              __at(0x7AAA);	// @ (0xF55 * 8 + 2)
#define                                 MDCHS2_bit          _BIT_ACCESS(MDCARH,2)
// MDCON1<MDCHSYNC>
extern volatile __bit                   MDCHSYNC            __at(0x7A94);	// @ (0xF52 * 8 + 4)
#define                                 MDCHSYNC_bit        _BIT_ACCESS(MDCON1,4)
// MDCON1<MDCLPOL>
extern volatile __bit                   MDCLPOL             __at(0x7A91);	// @ (0xF52 * 8 + 1)
#define                                 MDCLPOL_bit         _BIT_ACCESS(MDCON1,1)
// MDCARL<MDCLS0>
extern volatile __bit                   MDCLS0              __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 MDCLS0_bit          _BIT_ACCESS(MDCARL,0)
// MDCARL<MDCLS1>
extern volatile __bit                   MDCLS1              __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 MDCLS1_bit          _BIT_ACCESS(MDCARL,1)
// MDCARL<MDCLS2>
extern volatile __bit                   MDCLS2              __at(0x7AA2);	// @ (0xF54 * 8 + 2)
#define                                 MDCLS2_bit          _BIT_ACCESS(MDCARL,2)
// MDCON1<MDCLSYNC>
extern volatile __bit                   MDCLSYNC            __at(0x7A90);	// @ (0xF52 * 8 + 0)
#define                                 MDCLSYNC_bit        _BIT_ACCESS(MDCON1,0)
// MDCON0<MDEN>
extern volatile __bit                   MDEN                __at(0x7A8F);	// @ (0xF51 * 8 + 7)
#define                                 MDEN_bit            _BIT_ACCESS(MDCON0,7)
// MDCON0<MDOPOL>
extern volatile __bit                   MDOPOL              __at(0x7A8C);	// @ (0xF51 * 8 + 4)
#define                                 MDOPOL_bit          _BIT_ACCESS(MDCON0,4)
// MDCON0<MDOUT>
extern volatile __bit                   MDOUT               __at(0x7A8D);	// @ (0xF51 * 8 + 5)
#define                                 MDOUT_bit           _BIT_ACCESS(MDCON0,5)
// MDSRCPPS<MDSRCPPS0>
extern volatile __bit                   MDSRCPPS0           __at(0x75A0);	// @ (0xEB4 * 8 + 0)
#define                                 MDSRCPPS0_bit       _BIT_ACCESS(MDSRCPPS,0)
// MDSRCPPS<MDSRCPPS1>
extern volatile __bit                   MDSRCPPS1           __at(0x75A1);	// @ (0xEB4 * 8 + 1)
#define                                 MDSRCPPS1_bit       _BIT_ACCESS(MDSRCPPS,1)
// MDSRCPPS<MDSRCPPS2>
extern volatile __bit                   MDSRCPPS2           __at(0x75A2);	// @ (0xEB4 * 8 + 2)
#define                                 MDSRCPPS2_bit       _BIT_ACCESS(MDSRCPPS,2)
// MDSRCPPS<MDSRCPPS3>
extern volatile __bit                   MDSRCPPS3           __at(0x75A3);	// @ (0xEB4 * 8 + 3)
#define                                 MDSRCPPS3_bit       _BIT_ACCESS(MDSRCPPS,3)
// MDSRCPPS<MDSRCPPS4>
extern volatile __bit                   MDSRCPPS4           __at(0x75A4);	// @ (0xEB4 * 8 + 4)
#define                                 MDSRCPPS4_bit       _BIT_ACCESS(MDSRCPPS,4)
// MDSRC<MDSRCS0>
extern volatile __bit                   MDSRCS0             __at(0x7A98);	// @ (0xF53 * 8 + 0)
#define                                 MDSRCS0_bit         _BIT_ACCESS(MDSRC,0)
// MDSRC<MDSRCS1>
extern volatile __bit                   MDSRCS1             __at(0x7A99);	// @ (0xF53 * 8 + 1)
#define                                 MDSRCS1_bit         _BIT_ACCESS(MDSRC,1)
// MDSRC<MDSRCS2>
extern volatile __bit                   MDSRCS2             __at(0x7A9A);	// @ (0xF53 * 8 + 2)
#define                                 MDSRCS2_bit         _BIT_ACCESS(MDSRC,2)
// MDSRC<MDSRCS3>
extern volatile __bit                   MDSRCS3             __at(0x7A9B);	// @ (0xF53 * 8 + 3)
#define                                 MDSRCS3_bit         _BIT_ACCESS(MDSRC,3)
// OSCEN<MFOEN>
extern volatile __bit                   MFOEN               __at(0x76E5);	// @ (0xEDC * 8 + 5)
#define                                 MFOEN_bit           _BIT_ACCESS(OSCEN,5)
// OSCSTAT<MFOR>
extern volatile __bit                   MFOR                __at(0x76DD);	// @ (0xEDB * 8 + 5)
#define                                 MFOR_bit            _BIT_ACCESS(OSCSTAT,5)
// SSP1ADD<MSK01>
extern volatile __bit                   MSK01               __at(0x7C98);	// @ (0xF93 * 8 + 0)
#define                                 MSK01_bit           _BIT_ACCESS(SSP1ADD,0)
// SSP1ADD<MSK11>
extern volatile __bit                   MSK11               __at(0x7C99);	// @ (0xF93 * 8 + 1)
#define                                 MSK11_bit           _BIT_ACCESS(SSP1ADD,1)
// SSP1ADD<MSK21>
extern volatile __bit                   MSK21               __at(0x7C9A);	// @ (0xF93 * 8 + 2)
#define                                 MSK21_bit           _BIT_ACCESS(SSP1ADD,2)
// SSP1ADD<MSK31>
extern volatile __bit                   MSK31               __at(0x7C9B);	// @ (0xF93 * 8 + 3)
#define                                 MSK31_bit           _BIT_ACCESS(SSP1ADD,3)
// SSP1ADD<MSK41>
extern volatile __bit                   MSK41               __at(0x7C9C);	// @ (0xF93 * 8 + 4)
#define                                 MSK41_bit           _BIT_ACCESS(SSP1ADD,4)
// SSP1ADD<MSK51>
extern volatile __bit                   MSK51               __at(0x7C9D);	// @ (0xF93 * 8 + 5)
#define                                 MSK51_bit           _BIT_ACCESS(SSP1ADD,5)
// SSP1ADD<MSK61>
extern volatile __bit                   MSK61               __at(0x7C9E);	// @ (0xF93 * 8 + 6)
#define                                 MSK61_bit           _BIT_ACCESS(SSP1ADD,6)
// SSP1ADD<MSK71>
extern volatile __bit                   MSK71               __at(0x7C9F);	// @ (0xF93 * 8 + 7)
#define                                 MSK71_bit           _BIT_ACCESS(SSP1ADD,7)
// PMD4<MSSP1MD>
extern volatile __bit                   MSSP1MD             __at(0x772C);	// @ (0xEE5 * 8 + 4)
#define                                 MSSP1MD_bit         _BIT_ACCESS(PMD4,4)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x76C0);	// @ (0xED8 * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x76C1);	// @ (0xED8 * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x76C3);	// @ (0xED8 * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// STATUS<NEGATIVE>
extern volatile __bit                   NEGATIVE            __at(0x7EC4);	// @ (0xFD8 * 8 + 4)
#define                                 NEGATIVE_bit        _BIT_ACCESS(STATUS,4)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x76C4);	// @ (0xED8 * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x76C5);	// @ (0xED8 * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x76C6);	// @ (0xED8 * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x76D3);	// @ (0xEDA * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// SSP1STAT<NOT_A2>
extern volatile __bit                   NOT_A2              __at(0x7CAD);	// @ (0xF95 * 8 + 5)
#define                                 NOT_A2_bit          _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<NOT_ADDRESS>
extern volatile __bit                   NOT_ADDRESS         __at(0x7CAD);	// @ (0xF95 * 8 + 5)
#define                                 NOT_ADDRESS_bit     _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<NOT_ADDRESS1>
extern volatile __bit                   NOT_ADDRESS1        __at(0x7CAD);	// @ (0xF95 * 8 + 5)
#define                                 NOT_ADDRESS1_bit    _BIT_ACCESS(SSP1STAT,5)
// PCON0<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x7EB8);	// @ (0xFD7 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(PCON0,0)
// STATUS<NOT_PD>
extern volatile __bit                   NOT_PD              __at(0x7EC5);	// @ (0xFD8 * 8 + 5)
#define                                 NOT_PD_bit          _BIT_ACCESS(STATUS,5)
// PCON0<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x7EB9);	// @ (0xFD7 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(PCON0,1)
// PCON0<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x7EBA);	// @ (0xFD7 * 8 + 2)
#define                                 NOT_RI_bit          _BIT_ACCESS(PCON0,2)
// PCON0<NOT_RMCLR>
extern volatile __bit                   NOT_RMCLR           __at(0x7EBB);	// @ (0xFD7 * 8 + 3)
#define                                 NOT_RMCLR_bit       _BIT_ACCESS(PCON0,3)
// PCON0<NOT_RWDT>
extern volatile __bit                   NOT_RWDT            __at(0x7EBC);	// @ (0xFD7 * 8 + 4)
#define                                 NOT_RWDT_bit        _BIT_ACCESS(PCON0,4)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x7E7A);	// @ (0xFCF * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x7E4A);	// @ (0xFC9 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// T5CON<NOT_T5SYNC>
extern volatile __bit                   NOT_T5SYNC          __at(0x7E1A);	// @ (0xFC3 * 8 + 2)
#define                                 NOT_T5SYNC_bit      _BIT_ACCESS(T5CON,2)
// STATUS<NOT_TO>
extern volatile __bit                   NOT_TO              __at(0x7EC6);	// @ (0xFD8 * 8 + 6)
#define                                 NOT_TO_bit          _BIT_ACCESS(STATUS,6)
// SSP1STAT<NOT_W2>
extern volatile __bit                   NOT_W2              __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 NOT_W2_bit          _BIT_ACCESS(SSP1STAT,2)
// PCON0<NOT_WDTWV>
extern volatile __bit                   NOT_WDTWV           __at(0x7EBD);	// @ (0xFD7 * 8 + 5)
#define                                 NOT_WDTWV_bit       _BIT_ACCESS(PCON0,5)
// SSP1STAT<NOT_WRITE>
extern volatile __bit                   NOT_WRITE           __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 NOT_WRITE_bit       _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<NOT_WRITE1>
extern volatile __bit                   NOT_WRITE1          __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 NOT_WRITE1_bit      _BIT_ACCESS(SSP1STAT,2)
// DAC1CON0<NSS>
extern volatile __bit                   NSS                 __at(0x7998);	// @ (0xF33 * 8 + 0)
#define                                 NSS_bit             _BIT_ACCESS(DAC1CON0,0)
// NVMADR<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0x7BF0);	// @ (0xF7E * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADR,0)
// NVMADR<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0x7BF1);	// @ (0xF7E * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADR,1)
// NVMADR<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0x7BF2);	// @ (0xF7E * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADR,2)
// NVMADR<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0x7BF3);	// @ (0xF7E * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADR,3)
// NVMADR<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADR,4)
// NVMADR<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x7BF5);	// @ (0xF7E * 8 + 5)
